app/Controllers/Admin/Admin.php

    public function schedules()
    {
        // Get filters from request
        $statusFilter = $this->request->getGet('status');
        $dateFilter = $this->request->getGet('date');

        // Base query
        $query = $this->schedulesModel;

        // Apply filters if set
        if ($statusFilter) {
            $query = $query->where('status', $statusFilter);
        }
        if ($dateFilter) {
            $query = $query->where('collection_date', $dateFilter);
        }

        // Fetch all schedules with associated bin and waste details
        $schedules = $query->orderBy('collection_date', 'DESC')->findAll();

        foreach ($schedules as &$schedule) {
            $schedule['bins'] = $this->scheduleBinsModel
                ->select('schedule_bins.quantity, schedule_bins.cost, bin_sizes.size, waste_types.type AS waste_type')
                ->join('bin_sizes', 'bin_sizes.id = schedule_bins.bin_size_id')
                ->join('waste_types', 'waste_types.id = schedule_bins.waste_type_id')
                ->where('schedule_id', $schedule['id'])
                ->findAll();
---
SELECT *
FROM `schedules`
WHERE `status` = 'completed'
ORDER BY `collection_date` DESC
SELECT `schedule_bins`.`quantity`, `schedule_bins`.`cost`, `bin_sizes`.`size`, `waste_types`.`type` AS `waste_type`
FROM `schedule_bins`
JOIN `bin_sizes` ON `bin_sizes`.`id` = `schedule_bins`.`bin_size_id`
JOIN `waste_types` ON `waste_types`.`id` = `schedule_bins`.`waste_type_id`
WHERE `schedule_id` = '24'

    public function binWasteManagement()
    {
        $data['binSizes'] = $this->binSizesModel->findAll();
        $data['wasteTypes'] = $this->wasteTypesModel->findAll();
---
SELECT *
FROM `bin_sizes`
SELECT *
FROM `waste_types`

    public function unavailabilityManagement()
    {
        $unavailableDatesModel = new \App\Models\UnavailableDatesModel();
        $data['unavailableDates'] = $unavailableDatesModel->findAll();
---
SELECT *
FROM `unavailable_dates`