app/Controllers/Dashboard.php

    public function index()
    {
        $userId = session()->get('user_id');

        // Get upcoming collection for the user
        $upcomingSchedule = $this->schedulesModel
            ->where('user_id', $userId)
            ->where('status !=', 'completed')
            ->orderBy('collection_date', 'ASC')
            ->first();

        // If there’s an upcoming schedule, retrieve its bins
        if ($upcomingSchedule) {
            $upcomingSchedule['bins'] = $this->scheduleBinsModel
                ->select('schedule_bins.quantity, schedule_bins.cost, bin_sizes.size, waste_types.type AS waste_type')
                ->join('bin_sizes', 'bin_sizes.id = schedule_bins.bin_size_id')
                ->join('waste_types', 'waste_types.id = schedule_bins.waste_type_id')
                ->where('schedule_id', $upcomingSchedule['id'])
                ->findAll();
        }

        // Get recent schedules and their bins
        $recentSchedules = $this->schedulesModel
            ->where('user_id', $userId)
            ->orderBy('collection_date', 'DESC')
            ->findAll(5);

        foreach ($recentSchedules as &$schedule) {
            $schedule['bins'] = $this->scheduleBinsModel
                ->select('schedule_bins.quantity, schedule_bins.cost, bin_sizes.size, waste_types.type AS waste_type')
                ->join('bin_sizes', 'bin_sizes.id = schedule_bins.bin_size_id')
                ->join('waste_types', 'waste_types.id = schedule_bins.waste_type_id')
                ->where('schedule_id', $schedule['id'])
                ->findAll();
        }

        // Calculate quick stats
        $totalCollections = $this->schedulesModel->where('user_id', $userId)->countAllResults();
        $totalAmountSpent = $this->schedulesModel->where('user_id', $userId)->selectSum('total_cost')->get()->getRow()->total_cost;
        $pendingCollections = $this->schedulesModel->where(['user_id' => $userId, 'status' => 'pending'])->countAllResults();
---
SELECT *
FROM `schedules`
WHERE `user_id` = '4'
AND `status` != 'completed'
ORDER BY `collection_date` ASC
 LIMIT 1
SELECT `schedule_bins`.`quantity`, `schedule_bins`.`cost`, `bin_sizes`.`size`, `waste_types`.`type` AS `waste_type`
FROM `schedule_bins`
JOIN `bin_sizes` ON `bin_sizes`.`id` = `schedule_bins`.`bin_size_id`
JOIN `waste_types` ON `waste_types`.`id` = `schedule_bins`.`waste_type_id`
WHERE `schedule_id` = '5'
SELECT *
FROM `schedules`
WHERE `user_id` = '4'
ORDER BY `collection_date` DESC
 LIMIT 5
SELECT `schedule_bins`.`quantity`, `schedule_bins`.`cost`, `bin_sizes`.`size`, `waste_types`.`type` AS `waste_type`
FROM `schedule_bins`
JOIN `bin_sizes` ON `bin_sizes`.`id` = `schedule_bins`.`bin_size_id`
JOIN `waste_types` ON `waste_types`.`id` = `schedule_bins`.`waste_type_id`
WHERE `schedule_id` = '4'
SELECT COUNT(*) AS `numrows`
FROM `schedules`
WHERE `user_id` = '4'
SELECT SUM(`total_cost`) AS `total_cost`
FROM `schedules`
WHERE `user_id` = '4'
SELECT COUNT(*) AS `numrows`
FROM `schedules`
WHERE `user_id` = '4'
AND `status` = 'pending'