app/Controllers/Schedules.php

    public function index() {
        $status = $this->request->getVar('status');
        $userId = session()->get('user_id'); // Ensure you fetch schedules for the logged-in user

        $builder = $this->schedulesModel->where('user_id', $userId);

        // Apply the filter if a status is provided
        if ($status) {
            $builder->where('status', $status);
        }

        $data['schedules'] = $builder->orderBy('collection_date', 'DESC')->findAll();
---
SELECT *
FROM `schedules`
WHERE `user_id` = '14'
AND `status` = 'completed'
ORDER BY `collection_date` DESC

    public function create_schedule($id = null)
    {
        $data['wasteTypes'] = $this->wasteTypesModel->findAll();
        $data['binSizes'] = $this->binSizesModel->findAll();
---
SELECT *
FROM `waste_types`
SELECT *
FROM `bin_sizes`