app/Controllers/Users.php

    public function login() {
        if ($this->request->getMethod() === 'POST') {
            $data = $this->request->getPost();
            $user = $this->usersModel->where('email', $data['email'])->first();
---
SELECT *
FROM `users`
WHERE `email` = 'papistic980@gmail.com'
 LIMIT 1

    public function profile()
    {
        $userId = session()->get('user_id');
        $user = $this->usersModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '14'