app/Models/SchedulesModel.php

    public function getTotalIncome()
    {
        return $this->selectSum('total_cost')->get()->getRow()->total_cost;
---
SELECT SUM(`total_cost`) AS `total_cost`
FROM `schedules`

    public function getSchedulesPerMonth()
    {
        return $this->select('MONTH(collection_date) as month, COUNT(*) as count')
                    ->groupBy('month')
                    ->orderBy('month')
                    ->get()
                    ->getResultArray();
---
SELECT MONTH(collection_date) as month, COUNT(*) as count
FROM `schedules`
GROUP BY `month`
ORDER BY `month`

    public function getAverageCost()
    {
        return $this->selectAvg('total_cost')->get()->getRow()->total_cost;
---
SELECT AVG(`total_cost`) AS `total_cost`
FROM `schedules`